app/views/home/enrol_now.html.erb

SELECT "courses".* FROM "courses"
---
                <div class="form-group form-primary">
                  <%= select_tag "course", options_for_select(Course.all.collect{ |u| [u.name, u.id]}, @course.id), {:class =>"form-control form-select", prompt: 'Select Course'} %>