app/views/home/index.html.erb

SELECT "courses"."id" FROM "courses" ORDER BY "courses"."id" ASC LIMIT $1  [["LIMIT", 3]]
---
    <%
      Course.all.in_batches(of: 3) do |courses|