app/views/courses/_all_courses.html.erb

SELECT "courses"."id" FROM "courses" ORDER BY "courses"."id" ASC LIMIT $1  [["LIMIT", 3]]
---
  <%
    Course.all.in_batches(of: 3) do |courses|

SELECT "courses".* FROM "courses"
---
                      <div class="form-group form-primary">
                        <%= select_tag "course", options_for_select(Course.all.collect { |u| [u.name, u.id] }), { :class => "form-control form-select", prompt: 'Select Course' } %>