app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses" ORDER BY "courses"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def index
    @courses = Course.all
    @course = Course.first

SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    course_id = params[:id]
    @course = Course.find_by(id: course_id)

SELECT "courses".* FROM "courses" WHERE "courses"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
---
  def details
    course_id = params[:course]
    course = Course.find_by(id: course_id)

SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "courses"."id" FROM "courses" INNER JOIN "enrollments" ON "courses"."id" = "enrollments"."course_id" WHERE "enrollments"."user_id" = $1  [["user_id", 15]]
INSERT INTO "enrollments" ("user_id", "course_id", "start_date", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 6], ["course_id", 1], ["start_date", nil], ["price", nil], ["created_at", "2023-12-11 11:53:03.184127"], ["updated_at", "2023-12-11 11:53:03.184127"]]
SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def enrol
    course_id = params[:course]
    @course = Course.find_by(id: course_id)
    unless current_user.courses.pluck(:id).include?(@course.id)
      current_user.enrollments.create(course_id: @course.id)
      CourseMailer.with(user: current_user, course: @course).enrol.deliver_now