app/controllers/home_controller.rb

	def enrol_now
		course_id = params[:course_id]
		@course = Course.find_by(id: course_id)
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def submit_contact_query
		ContactFormQuery.create(contact_params)
---
INSERT INTO "contact_form_queries" ("first_name", "last_name", "email", "query_text", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["first_name", "jj"], ["last_name", "jjj"], ["email", "jjj@j.com"], ["query_text", "jkkk"], ["created_at", "2023-12-28 10:44:44.068440"], ["updated_at", "2023-12-28 10:44:44.068440"]]