app/controllers/users_home_controller.rb

  def dashboard
    user_id = params[:id]
    @user = User.find_by(id: user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def get_profile
    user_id = params[:id]
    @user = User.find_by(id: user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

  def update_profile
    user_id = params[:id]
    @user = User.find_by(id: user_id)
    profile_params = update_profile_params
    if profile_params["password"].blank? || profile_params["password_confirmation"].blank?
      profile_params.delete("current_password")
      profile_params.delete("password")
      profile_params.delete("password_confirmation")
      @user.update(profile_params)
      redirect_to get_user_profile_path(@user.id)
    elsif profile_params["current_password"].present? && profile_params["password"].present? &&
      profile_params["password_confirmation"].present? &&
      profile_params["password"] == profile_params["password_confirmation"]
      if @user.valid_password?(params["current_password"])
        @user.reset_password(profile_params["password"], profile_params["password_confirmation"])
      end
      profile_params.delete("current_password")
      profile_params.delete("password")
      profile_params.delete("password_confirmation")
      @user.update(profile_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1, "institute" = $2 WHERE "users"."id" = $3  [["updated_at", "2023-12-14 12:30:07.022870"], ["institute", "ubc"], ["id", 10]]
UPDATE "users" SET "updated_at" = $1, "institute" = $2, "position" = $3, "phone" = $4 WHERE "users"."id" = $5  [["updated_at", "2023-12-14 12:12:03.983701"], ["institute", ""], ["position", ""], ["phone", ""], ["id", 10]]