app/models/user.rb

SELECT "users".* FROM "users" WHERE "users"."provider" = $1 AND "users"."uid" = $2 ORDER BY "users"."id" ASC LIMIT $3  [["provider", "google_oauth2"], ["uid", "108309538967584081216"], ["LIMIT", 1]]
---
  def self.from_omniauth(auth)
    where(provider: auth.provider, uid: auth.uid).first || where(email: auth.info.email).first

INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "confirmation_token", "confirmed_at", "confirmation_sent_at", "unconfirmed_email", "created_at", "updated_at", "first_name", "last_name", "institute", "position", "phone", "address", "full_name", "uid", "avatar_url", "provider") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21) RETURNING "id"
---
  def self.create_from_omniauth(auth)
    User.create!({
                  email: auth.info.email,
                  password: "helloworld",
                  full_name: auth.info.name,
                  avatar_url:  auth.info.image,
                  provider: auth.provider,
                  uid: auth.uid
                })