app/controllers/users/omniauth_callbacks_controller.rb

  def google_oauth2
    debugger
    user = User.from_omniauth(auth)
    if user.blank?
      user = User.create_from_omniauth(auth)
---
INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "confirmation_token", "confirmed_at", "confirmation_sent_at", "unconfirmed_email", "created_at", "updated_at", "first_name", "last_name", "institute", "position", "phone", "address", "full_name", "uid", "avatar_url", "provider") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21) RETURNING "id"